app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "BNow there is a title"], ["updated_at", "2019-08-11 13:57:03.135676"], ["id", 4]]
---
      def update
        @article = Article.find(params[:id])
        @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 10]]
---
      def destroy
        @article = Article.destroy(params[:id])